In [58]:
import pandas as pd

In [59]:
pd.DataFrame({'A':[95,95,98,100],'B':[91,93,97,99]})

     A   B
0   95  91
1   95  93
2   98  97
3  100  99

In [60]:
pd.DataFrame({'A':[87,89],'B':[85,90]})

    A   B
0  87  85
1  89  90

In [61]:
df1=pd.DataFrame({'A':[95,95,98,100],'B':[91,93,97,99]})

In [62]:
df2=pd.DataFrame({'A':[87,89],'B':[85,90]})

In [63]:
pd.merge_ordered(df1,df2)

     A   B
0   87  85
1   89  90
2   95  91
3   95  93
4   98  97
5  100  99

In [64]:
pd.Grouper(df1,df2)

Grouper(key=     A   B
0   95  91
1   95  93
2   98  97
3  100  99, level=    A   B
0  87  85
1  89  90, axis=0, sort=False, dropna=True)

In [65]:
[df1]+[df2]

[     A   B
 0   95  91
 1   95  93
 2   98  97
 3  100  99,
     A   B
 0  87  85
 1  89  90]

In [66]:
# 데이터 프레임으로 접근
# df1.merge()

In [67]:
# pandas로 접근
# pd.merge()

In [68]:
pd.merge(df1,df2,how='outer')

     A   B
0   87  85
1   89  90
2   95  91
3   95  93
4   98  97
5  100  99

In [69]:
df3=pd.DataFrame({'D':[100,100,100,100]})

In [70]:
pd.concat([df1,df3],axis=1)

     A   B    D
0   95  91  100
1   95  93  100
2   98  97  100
3  100  99  100

In [79]:
df_left=pd.DataFrame({'Name':['Harry Potter','David Baker','John Smith','Juan Martinez','Jane Connor'],
                      'Gender':['Male','Male','Male','Male','Female'],'Age':[23,31,22,36,30]})

In [80]:
df_right=pd.DataFrame({'Name':['John Smith','Alex Du Bois','Joanne Rowling','Jane Connor'],
                      'Position':['Intern','Team Lead','Manager','Manager'],'Wage':[25000,75000,90000,70000]})

In [81]:
df_left

            Name  Gender  Age
0   Harry Potter    Male   23
1    David Baker    Male   31
2     John Smith    Male   22
3  Juan Martinez    Male   36
4    Jane Connor  Female   30

In [82]:
df_right

             Name   Position   Wage
0      John Smith     Intern  25000
1    Alex Du Bois  Team Lead  75000
2  Joanne Rowling    Manager  90000
3     Jane Connor    Manager  70000

In [83]:
df_left.columns , df_right.columns

(Index(['Name', 'Gender', 'Age'], dtype='object'),
 Index(['Name', 'Position', 'Wage'], dtype='object'))

In [84]:
pd.merge(df_left,df_right,on='Name')

          Name  Gender  Age Position   Wage
0   John Smith    Male   22   Intern  25000
1  Jane Connor  Female   30  Manager  70000

In [86]:
pd.merge(df_left,df_right,on='Name', how='inner') #innerjoin

          Name  Gender  Age Position   Wage
0   John Smith    Male   22   Intern  25000
1  Jane Connor  Female   30  Manager  70000

In [88]:
pd.merge(df_left,df_right,on='Name', how='left')

            Name  Gender  Age Position     Wage
0   Harry Potter    Male   23      NaN      NaN
1    David Baker    Male   31      NaN      NaN
2     John Smith    Male   22   Intern  25000.0
3  Juan Martinez    Male   36      NaN      NaN
4    Jane Connor  Female   30  Manager  70000.0

In [89]:
pd.merge(df_left,df_right,on='Name', how='right')

             Name  Gender   Age   Position   Wage
0      John Smith    Male  22.0     Intern  25000
1    Alex Du Bois     NaN   NaN  Team Lead  75000
2  Joanne Rowling     NaN   NaN    Manager  90000
3     Jane Connor  Female  30.0    Manager  70000

In [90]:
pd.merge(df_left,df_right,on='Name', how='outer')

             Name  Gender   Age   Position     Wage
0    Alex Du Bois     NaN   NaN  Team Lead  75000.0
1     David Baker    Male  31.0        NaN      NaN
2    Harry Potter    Male  23.0        NaN      NaN
3     Jane Connor  Female  30.0    Manager  70000.0
4  Joanne Rowling     NaN   NaN    Manager  90000.0
5      John Smith    Male  22.0     Intern  25000.0
6   Juan Martinez    Male  36.0        NaN      NaN